Revit.Elements.GlobalParameter.#ctor(System.String,Autodesk.Revit.DB.ForgeTypeId)
GlobalParameter
name:
forgeTypeId:

Revit.Elements.GlobalParameter.InitGlobalParameter(System.String,Autodesk.Revit.DB.ForgeTypeId)
Initialize a GlobalParameter element
name:
forgeTypeId:

Revit.Elements.GlobalParameter.SetValueToElementId(Revit.Elements.GlobalParameter,System.Int64)
Set Global Parameter Value to an Element ID from Integer
parameter:
elementId:

Revit.Elements.GlobalParameter.SpecType
Get SpecType

Revit.Elements.GlobalParameter.GroupType
Get Parameter Group Type

Revit.Elements.GlobalParameter.ByName(System.String,Revit.Elements.SpecType)
Create a new Global Parameter by Name and Type
name: Name fo the parameter
specType: The type of new global parameter.
Returns: